Documents/СборГрафиковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СборГрафиковОтпусков</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборЗапущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСбораГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойСборГрафиков</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаСбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторСбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСотрудников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборАннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннулирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаАннулирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внешний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПожеланияСотрудниковВидныТолькоОтветственному</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКорневойСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СостоянияСбораГрафиковОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСбораГрафиковОтпусков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПриложенияДляИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПриложенияДляИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УправлениеПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабинетСотрудника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ГрафикОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ГрафикОтпусков</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителяКадровойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителяКадровойСлужбы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборГрафиковОтпусков</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборГрафиковОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СборГрафиковОтпусков/Forms/ФормаДокументКорневой/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Ключ.Пустая() Тогда
	
		// Заполнение нового документа.
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		Объект.ИнициаторСбора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.ТекущийПользователь(), "ФизическоеЛицо");
		
		ТекущаяДата = ТекущаяДатаСеанса();
		
		Объект.Год = Год(ТекущаяДата);
		
		Если Месяц(ТекущаяДата) > 9 Тогда
			Объект.Год = Объект.Год + 1;	
		КонецЕсли;
		
		Объект.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Черновик;
		Объект.СборПоПодразделениям = СборГрафиковОтпусков.СборГрафиковОтпусковПоПодразделениямДоступен();
		
		ИнициализироватьФорму();
		ПриПолученииДанныхНаСервере();
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ИнициализироватьФорму();
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РегистрыСведений.НастройкиСбораГрафиковОтпусковКабинетСотрудника.СохранитьНовыеНастройки(Настройки, ТекущийОбъект.Ссылка);
	ОбновитьСтруктуруКампанииСбораГрафиковОтпусков(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Для Каждого Строка Из СобранныеГрафики.ПолучитьЭлементы() Цикл
		Элементы.СобранныеГрафики.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСобранныеГрафики

&НаКлиенте
Процедура СобранныеГрафикиВключитьВСборПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СобранныеГрафики.ТекущиеДанные;
	ПриИзмененииПометкиВключитьВСбор(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваФормыСобранныеГрафики

&НаКлиенте
Процедура СобранныеГрафикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ГрафикОтпусков) Тогда
		ФормаДокументаПодразделение = ПолучитьФорму("Документ.СборГрафиковОтпусков.Форма.ГрафикПодразделения",
			Новый Структура("Ключ", Элемент.ТекущиеДанные.ГрафикОтпусков),
			ЭтаФорма);
		ФормаДокументаПодразделение.Открыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьСбор(Команда)
	
	Если Параметры.Ключ.Пустая() Или Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Начать кампанию можно только для записанного документа. 
							|Записать и начать кампанию сбора графиков отпусков?'");	
		Оповещение = Новый ОписаниеОповещения("ЗаписатьДокументПередНачаломСбораЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
	Иначе 
		НачатьСборГрафиковОтпусков();
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументПередНачаломСбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да И ПроверитьЗаполнение() Тогда				
		Записать();
		НачатьСборЗавершение(Результат, Параметры);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСборГрафиковОтпусков()
	
	ТекстВопроса = НСтр("ru='Начать кампанию сбора графиков отпусков?'");
	Оповещение = Новый ОписаниеОповещения("НачатьСборЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСборЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьСтатусСбора("СборЗапущен", Истина);
	КонецЕсли;  
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьСбор(Команда)
	
	Если Параметры.Ключ.Пустая() Или Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Завершить кампанию можно только для записанного документа. 
		|Записать?'");	
		Оповещение = Новый ОписаниеОповещения("ЗаписатьДокументПередЗавершениемСбораЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
	Иначе 
		ЗавершитьСборГрафиковОтпусков();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументПередЗавершениемСбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да И ПроверитьЗаполнение() Тогда		
		Записать();
		ЗавершитьСборГрафиковОтпусков();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСборГрафиковОтпусков()
	
	Если ПоступившиеСборыГрафиковОтпусковУтверждены(Объект.Ссылка) Тогда
	
		ТекстВопроса = НСтр("ru='Возобновление кампании сбора графиков отпусков после завершения невозможно!
							|Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗавершитьСборЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);

	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не все поступившие сборы графиков по подразделениям были утверждены в сервисе 1С:Кабинет сотрудника.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСборЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьСтатусСбора("СборЗавершен", Истина);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьСбор(Команда)
	
	Если Объект.СборЗапущен Тогда
		Если Параметры.Ключ.Пустая() Или Модифицированность Тогда
			ТекстВопроса = НСтр("ru = 'Аннулировать кампанию можно только для записанного документа. 
			|Записать?'");	
			Оповещение = Новый ОписаниеОповещения("ЗаписатьДокументПередАннулированиемСбораЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
		Иначе 
			АннулироватьСборГрафиковОтпусков();
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Аннулировать кампанию можно только для начатого сбора.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокументПередАннулированиемСбораЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да И ПроверитьЗаполнение() Тогда
		Записать();
		АннулироватьСборГрафиковОтпусков();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьСборГрафиковОтпусков()
	
	ТекстВопроса = НСтр("ru='Возобновление кампании сбора графиков отпусков после аннулирования невозможно!
						|Продолжить?'");
	Оповещение = Новый ОписаниеОповещения("АннулироватьСборЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьСборЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда      
		ЗаполнитьДанныеАннулирования();
		УстановитьСтатусСбора("СборАннулирован", Истина);
	КонецЕсли;  
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись);
	ЗаписатьНаКлиенте(Истина, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", ?(Объект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	ЗаписатьНаКлиенте(Ложь, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоздатьГрафикОтпусков(Команда)
	
	ИдентификаторОрганизации = Новый УникальныйИдентификатор(СтрЗаменить(Сред(Команда.Имя, 15), "_", "-"));
	ПараметрыДокумента = ПараметрыГрафикаОтпусков(Объект.Ссылка, ИдентификаторОрганизации);
	
	Если ЗначениеЗаполнено(ПараметрыДокумента.Ссылка) Тогда 
		ОткрытьФорму("Документ.ГрафикОтпусков.ФормаОбъекта", Новый Структура("Ключ", ПараметрыДокумента.Ссылка));
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура("СборГрафиковОтпусков, Организация, Действие", 
		Объект.Ссылка, ПараметрыДокумента.Организация, "ЗаполнитьПоСборуГрафиковОтпусков");
	
	ПараметрыФормы = Новый Структура("Основание", Основание);
	ОткрытьФорму("Документ.ГрафикОтпусков.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СобранныеГрафикиВключитьВСбор");

	ГруппаОтбораПоВидуСбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораПоВидуСбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбораПоВидуСбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СборПоПодразделениям");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ГруппаОтбораПоВыбраннымПодразделениям = ГруппаОтбораПоВидуСбора.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораПоВыбраннымПодразделениям.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбораПоВыбраннымПодразделениям.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СборПоПодразделениям");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = ГруппаОтбораПоВыбраннымПодразделениям.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СобранныеГрафики.Выгружать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = ГруппаОтбораПоВидуСбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СборАннулирован");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = ГруппаОтбораПоВидуСбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СборЗавершен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = ГруппаОтбораПоВидуСбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СобранныеГрафики.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияСбораГрафиковОтпусков.Утверждено;	

	ОтборЭлемента = ГруппаОтбораПоВидуСбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СобранныеГрафики.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияСбораГрафиковОтпусков.Отказано;	

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ПубликоватьСтруктуруЮридическихЛиц = ИнтеграцияУправлениеПерсоналом.ПубликоватьСтруктуруЮридическихЛиц();   

	Если Объект.СборЗапущен Тогда
	
		УстановитьПараметрЕстьПолныйДоступ();
		
	Иначе
		
		ЕстьПолныйДоступ = Истина;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Настройки, РегистрыСведений.НастройкиСбораГрафиковОтпусковКабинетСотрудника.Настройки());
	
	Если Объект.СборЗапущен Или Объект.СборПоПодразделениям Тогда
		ЗаполнитьСобранныеГрафики();
	КонецЕсли;
	
	ЗаполнитьКомандыСозданияГрафикаОтпусков();
	УстановитьСвойстваЭлементовФормы();

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрЕстьПолныйДоступ()  
	
	ДоступныеПодразделения = ИнтеграцияКабинетСотрудникаРасширенный.ПодразделенияПравилДляСбораГрафикаОтпусков();
	УстановитьПривилегированныйРежим(Истина);
	ВсеПодразделения = ИнтеграцияКабинетСотрудникаРасширенный.ПодразделенияПравилДляСбораГрафикаОтпусков();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЕстьПолныйДоступ = (ВсеПодразделения.Количество() = ДоступныеПодразделения.Количество());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	СборЗакрыт = Объект.СборЗавершен Или Объект.СборАннулирован;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаЗаписатьИЗакрыть", "Доступность", НЕ СборЗакрыт);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаЗаписать", "Доступность", НЕ СборЗакрыт);
			
	Если Объект.Внешний Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаНачатьСбор", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗавершитьСбор", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаАннулироватьСбор", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СобранныеГрафикиСостояние", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Ответственный", "Видимость", Ложь);
		
	Иначе
		
		СборВРаботе = Объект.СборЗапущен И Не Объект.СборЗавершен И Не Объект.СборАннулирован;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаНачатьСбор", "Заголовок", ?(Объект.СборЗапущен, НСтр("ru = 'Сбор начат'"), НСтр("ru = 'Начать сбор'")));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаНачатьСбор", "Доступность", НЕ Объект.СборЗапущен И НЕ Объект.ПометкаУдаления);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаНачатьСбор", "ЦветФона", ?(СборВРаботе, ЦветаСтиля.ПравоПросмотраФон, ЦветаСтиля.ЦветФонаКнопки));	
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаЗавершитьСбор", "Заголовок", ?(Объект.СборЗавершен, НСтр("ru = 'Сбор завершен'"), НСтр("ru = 'Завершить сбор'")));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаЗавершитьСбор", "Видимость", СборВРаботе Или Объект.СборЗавершен);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаЗавершитьСбор", "Доступность", СборВРаботе);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаЗавершитьСбор", "ЦветФона", ?(Объект.СборЗавершен, ЦветаСтиля.ПравоПросмотраФон, ЦветаСтиля.ЦветФонаКнопки));	 
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаАннулироватьСбор", "Заголовок", ?(Объект.СборАннулирован, НСтр("ru = 'Сбор аннулирован'"), НСтр("ru = 'Аннулировать сбор'")));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаАннулироватьСбор", "Видимость", СборВРаботе Или Объект.СборАннулирован);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаАннулироватьСбор", "Доступность", СборВРаботе);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФормаАннулироватьСбор", "ЦветФона", ?(Объект.СборАннулирован, ЦветаСтиля.ПравоСозданияФон, ЦветаСтиля.ЦветФонаКнопки));	 

		Если Не ЕстьПолныйДоступ Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ФормаЗавершитьСбор", "Доступность", Ложь);
				
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ФормаАннулироватьСбор", "Видимость", Ложь Или Объект.СборАннулирован);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ФормаАннулироватьСбор", "Доступность", Ложь); 
				
			УстановитьИнформационноеСообщение();
			
		КонецЕсли;
		
		Если Объект.СборАннулирован Тогда
			УстановитьИнформационноеСообщениеОбАннулировании();
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ИнициаторСбора", "ТолькоПросмотр", Объект.СборЗапущен);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Год", "ТолькоПросмотр", Объект.СборЗапущен);
		  
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДатаОкончанияСбора", "ТолькоПросмотр", СборЗакрыт);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДатаНомер", "ТолькоПросмотр", Объект.СборЗапущен);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СобранныеГрафикиВключитьВСбор", "Видимость", Объект.СборПоПодразделениям);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДатаОкончанияСбора", "Видимость", Объект.СборПоПодразделениям);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаНастройки", "Видимость", Объект.СборПоПодразделениям);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НастройкиРазрешитьОтпускНеПланирую", "ТолькоПросмотр", СборЗакрыт);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СборГрафиковОтпусковСхемаПредставленияПодразделений", "ТолькоПросмотр", СборЗакрыт);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Подвал", "ТолькоПросмотр", СборЗакрыт);

	УстановитьДоступностьСозданияГрафикаОтпусков();

КонецПроцедуры

&НаСервере
Процедура УстановитьИнформационноеСообщение()
	
	ПрефиксЭлементов = "ИнформацияОДоступностиРедактирования";

	ИмяГруппы = ПрефиксЭлементов + "Группа";
	ИнформацияОДоступностиРедактированияГруппа = Элементы.Найти(ИмяГруппы);
	Если ИнформацияОДоступностиРедактированияГруппа = Неопределено Тогда
		
		// Информация о невозможности редактирования
		ИнформацияОДоступностиРедактированияГруппа = Элементы.Вставить(ИмяГруппы, Тип("ГруппаФормы"), ЭтаФорма, Элементы.Найти("Шапка"));
		ИнформацияОДоступностиРедактированияГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ИнформацияОДоступностиРедактированияГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ИнформацияОДоступностиРедактированияГруппа.ОтображатьЗаголовок = Ложь;                             
		
		НовыйЭлемент = Элементы.Добавить(
			ПрефиксЭлементов + "КартинкаИнформация", Тип("ДекорацияФормы"), ИнформацияОДоступностиРедактированияГруппа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Информация16АнимированнаяБЗК;
		
		НовыйЭлемент = Элементы.Добавить(
			ПрефиксЭлементов + "Надпись", Тип("ДекорацияФормы"), ИнформацияОДоступностиРедактированияГруппа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = НСтр("ru = 'Завершение сбора недоступно. Требуется доступ ко всей структуре предприятия. Обратитесь к вашему администратору.'");
			НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;   
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	УстанавливаемыеПараметры = Новый Структура;
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавливаемыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	ДобавитьКомандыСозданияГрафикаОтпусков();
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАннулирования()
	Объект.ОтветственныйЗаАннулирование = Пользователи.ТекущийПользователь();
	Объект.ДатаАннулирования = ТекущаяДатаСеанса(); 
КонецПроцедуры		

&НаСервере
Процедура УстановитьИнформационноеСообщениеОбАннулировании()
	
	ПрефиксЭлементов = "ИнформацияОбАннулировании";

	ИмяГруппы = ПрефиксЭлементов + "Группа";
	ИнформацияОбАннулированииГруппа = Элементы.Найти(ИмяГруппы);
	Если ИнформацияОбАннулированииГруппа = Неопределено Тогда
		
		// Информация о невозможности редактирования
		ИнформацияОбАннулированииГруппа = Элементы.Вставить(ИмяГруппы, Тип("ГруппаФормы"), ЭтаФорма, Элементы.Найти("Шапка"));
		ИнформацияОбАннулированииГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ИнформацияОбАннулированииГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ИнформацияОбАннулированииГруппа.ОтображатьЗаголовок = Ложь;                             
		
		НовыйЭлемент = Элементы.Добавить(
			ПрефиксЭлементов + "КартинкаИнформация", Тип("ДекорацияФормы"), ИнформацияОбАннулированииГруппа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Информация16АнимированнаяБЗК;
		
		НовыйЭлемент = Элементы.Добавить(
			ПрефиксЭлементов + "Надпись", Тип("ДекорацияФормы"), ИнформацияОбАннулированииГруппа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = СтрШаблон(
			НСтр("ru = 'Кампания по сбору графиков отпусков аннулирована (%1 г. в %2, пользователем: %3)'"),
			Формат(Объект.ДатаАннулирования, "ДФ=dd.MM.yyyy"),
			Формат(Объект.ДатаАннулирования, "ДФ=HH:mm"),
			Строка(Объект.ОтветственныйЗаАннулирование));
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;   
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте(ЗакрытьПослеЗаписи, ПараметрыЗаписи)
		
	ПараметрыЗаписи.Вставить("ПроверкаПередЗаписьюВыполнена", Истина);

	Записать(ПараметрыЗаписи);
	Если ЗакрытьПослеЗаписи Тогда
		Закрыть();
	КонецЕсли;
		
КонецПроцедуры

// Заполнить ответственных за сбор.
// 
// Параметры:
//  СтрокиСборовПодразделений - Массив из см. ОписаниеДокументаГрафикПодразделения - Сборы без ответственных
&НаСервере
Процедура ЗаполнитьОтветственныхЗаСбор(СтрокиСборовПодразделений)
	
	Если СтрокиСборовПодразделений.Количество() > 0 Тогда
		
		Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника;
		
		ПодразделенияОтветственных = Новый Массив;
		Для Каждого СтрокаСбора Из СтрокиСборовПодразделений Цикл
			Если ЗначениеЗаполнено(СтрокаСбора.Подразделение) 
				И (Не ЗначениеЗаполнено(СтрокаСбора.ГрафикСбора) 
					Или Не ЗначениеЗаполнено(СтрокаСбора.ОтветственныйЗаСбор)) Тогда
				ПодразделенияОтветственных.Добавить(СтрокаСбора.Подразделение);
			КонецЕсли;
		КонецЦикла;
		
		Если ПодразделенияОтветственных.Количество() > 0 Тогда 

			УстановитьПривилегированныйРежим(Истина);
			ПубликуемыеРуководители = ИнтеграцияУправлениеПерсоналомРасширенный.ПубликуемыеРуководители(Приложение, ПодразделенияОтветственных);
			УстановитьПривилегированныйРежим(Ложь);
			
			Для Каждого СтрокаСбора Из СтрокиСборовПодразделений Цикл
				РуководительПодразделения = ПубликуемыеРуководители.Получить(СтрокаСбора.Подразделение); 
				Если ЗначениеЗаполнено(РуководительПодразделения) Тогда 
					СтрокаСбора.ОтветственныйЗаСбор = РуководительПодразделения;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьВключаемыеВСборПодразделения(ТекущийОбъект, Дерево)
		
	ВключаемыеВСборПодразделения = Новый Массив();
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		ВключитьВСбор = ТриСостоянияВБулево(СтрокаДерева.ВключитьВСбор);
		СборЗавершен = СтрокаДерева.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Утверждено
			Или СтрокаДерева.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Отказано;
		Если ВключитьВСбор Тогда
			Если ЗначениеЗаполнено(СтрокаДерева.ГрафикОтпусков) И Не СборЗавершен  Тогда 
				Запись = СборГрафиковОтпусков.ОписаниеДокументаГрафикПодразделения();
				Запись.ГрафикСбора							= СтрокаДерева.ГрафикОтпусков;
				Запись.Дата 								= СтрокаДерева.Дата;
				Запись.Год 									= СтрокаДерева.Год;
				Запись.Подразделение 						= СтрокаДерева.Подразделение;
				Запись.ОтветственныйЗаСбор 					= СтрокаДерева.ОтветственныйЗаСбор;
				Запись.СостояниеСбораГрафиковОтпусков 		= СтрокаДерева.Состояние;
				Запись.КорневойСборГрафиков 				= ТекущийОбъект.Ссылка;
				Запись.ИдентификаторДокумента 				= СтрокаДерева.ИдентификаторДокумента;			
				ВключаемыеВСборПодразделения.Добавить(Запись);
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаДерева.ГрафикОтпусков) Тогда
				Запись = СборГрафиковОтпусков.ОписаниеДокументаГрафикПодразделения();
				Запись.Год 									= ТекущийОбъект.Год;
				Запись.Подразделение 						= СтрокаДерева.Подразделение;
				Запись.СостояниеСбораГрафиковОтпусков 		= ТекущийОбъект.Состояние;
				Запись.КорневойСборГрафиков 				= ТекущийОбъект.Ссылка;
				ВключаемыеВСборПодразделения.Добавить(Запись);				
			КонецЕсли;
		КонецЕсли;
		ВключаемыеВСборПодразделенияСтроки = ЗаполнитьВключаемыеВСборПодразделения(ТекущийОбъект, СтрокаДерева);
		Если ВключаемыеВСборПодразделенияСтроки.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВключаемыеВСборПодразделения, ВключаемыеВСборПодразделенияСтроки, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВключаемыеВСборПодразделения
	
КонецФункции

&НаСервере
Функция ЗаполнитьИсключаемыеИзСбораПодразделения(ТекущийОбъект, Дерево)

	ИсключаемыеИзСбораПодразделения = Новый Массив();
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		ВключитьВСбор = ТриСостоянияВБулево(СтрокаДерева.ВключитьВСбор);
		Если Не ВключитьВСбор Тогда
			СборЗавершен = СтрокаДерева.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Утверждено
				Или СтрокаДерева.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Отказано;			
			Если ЗначениеЗаполнено(СтрокаДерева.ГрафикОтпусков) И Не СборЗавершен Тогда 
				Запись = СборГрафиковОтпусков.ОписаниеДокументаГрафикПодразделения();
				Запись.ГрафикСбора							= СтрокаДерева.ГрафикОтпусков;
				Запись.Дата 								= СтрокаДерева.Дата;
				Запись.Год 									= СтрокаДерева.Год;
				Запись.Подразделение 						= СтрокаДерева.Подразделение;
				Запись.ОтветственныйЗаСбор 					= СтрокаДерева.ОтветственныйЗаСбор;
				Запись.СостояниеСбораГрафиковОтпусков 		= СтрокаДерева.Состояние;
				Запись.КорневойСборГрафиков 				= ТекущийОбъект.Ссылка;
				Запись.ИдентификаторДокумента 				= СтрокаДерева.ИдентификаторДокумента;			
				ИсключаемыеИзСбораПодразделения.Добавить(Запись);
			КонецЕсли;
		КонецЕсли;
		ИсключаемыеИзСбораПодразделенияСтроки = ЗаполнитьИсключаемыеИзСбораПодразделения(ТекущийОбъект, СтрокаДерева);
		Если ИсключаемыеИзСбораПодразделенияСтроки.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеИзСбораПодразделения, ИсключаемыеИзСбораПодразделенияСтроки, Истина);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ИсключаемыеИзСбораПодразделения

КонецФункции

&НаСервере
Функция ТриСостоянияВБулево(Значение)
	Возврат ?(Значение = 2, Ложь, Булево(Значение));
КонецФункции

&НаКлиенте
Процедура УстановитьСтатусСбора(ИмяФлага, ЗначениеФлага)
	
	Объект[ИмяФлага] = ЗначениеФлага;
	
	Записать();
	
	УстановитьСвойстваЭлементовФормы();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоступившиеСборыГрафиковОтпусковУтверждены(КорневойСборГрафиковОтпусков)
	Возврат	СборГрафиковОтпусков.СборыГрафиковОтпусковПодразделенийУтверждены(КорневойСборГрафиковОтпусков);
КонецФункции

&НаСервере
Процедура ДобавитьКомандыСозданияГрафикаОтпусков()
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.ГрафикОтпусков) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления
		|	И НЕ Организации.Предопределенный";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ИмяКоманды = ИмяКомандыСоздатьГрафикОтпусков(Выборка.Ссылка);
		Если Команды.Найти(ИмяКоманды) = Неопределено Тогда
			
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "Подключаемый_СоздатьГрафикОтпусков";
			
			НовыйЭлемент = Элементы.Добавить(НоваяКоманда.Имя, Тип("КнопкаФормы"), Элементы.ПодменюГрафикОтпусков);
			НовыйЭлемент.Заголовок = Выборка.Наименование;
			НовыйЭлемент.ИмяКоманды = НоваяКоманда.Имя;
			НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			НовыйЭлемент.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяКомандыСоздатьГрафикОтпусков(Организация)
	
	Возврат "ГрафикОтпусков" + СтрЗаменить(Строка(Организация.УникальныйИдентификатор()), "-", "_");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыГрафикаОтпусков(СборГрафиковОтпусков, ИдентификаторОрганизации) 
	
	ПараметрыДокумента = Новый Структура("Ссылка, Организация");
	ПараметрыДокумента.Организация = Справочники.Организации.ПолучитьСсылку(ИдентификаторОрганизации);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СборГрафиковОтпусков", СборГрафиковОтпусков);
	Запрос.УстановитьПараметр("Организация", ПараметрыДокумента.Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикОтпусков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ГрафикОтпусков КАК ГрафикОтпусков
		|ГДЕ
		|	ГрафикОтпусков.СборГрафиковОтпусков = &СборГрафиковОтпусков
		|	И ГрафикОтпусков.Организация = &Организация
		|	И НЕ ГрафикОтпусков.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГрафикОтпусков.Проведен УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ПараметрыДокумента.Ссылка = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПараметрыДокумента;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьСозданияГрафикаОтпусков()
	
	Если Не Объект.СборЗавершен Тогда 
		Для Каждого КнопкаФормы Из Элементы.ПодменюГрафикОтпусков.ПодчиненныеЭлементы Цикл 
			КнопкаФормы.Видимость = Ложь;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для Каждого КнопкаФормы Из Элементы.ПодменюГрафикОтпусков.ПодчиненныеЭлементы Цикл 
		КнопкаФормы.Видимость = КомандыСозданияГрафикаОтпусков.Получить(КнопкаФормы.ИмяКоманды) <> Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомандыСозданияГрафикаОтпусков()
	
	ИменаКоманд = Новый Соответствие;
	Если Не Объект.СборЗавершен Тогда 
		КомандыСозданияГрафикаОтпусков = Новый ФиксированноеСоответствие(ИменаКоманд);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КорневойСборГрафиков", Объект.Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СборГрафиковОтпусковСотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Документ.СборГрафиковОтпусков.Сотрудники КАК СборГрафиковОтпусковСотрудники
		|ГДЕ
		|	СборГрафиковОтпусковСотрудники.Ссылка.КорневойСборГрафиков = &КорневойСборГрафиков";
	
	ФизическиеЛица = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ФизическиеЛица;
	ПараметрыПолучения.КадровыеДанные = "Организация";
	ДанныеОрганизаций = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	ДанныеОрганизаций.Свернуть("Организация");
	
	Для Каждого ДанныеОрганизации Из ДанныеОрганизаций Цикл 
		ИменаКоманд.Вставить(ИмяКомандыСоздатьГрафикОтпусков(ДанныеОрганизации.Организация), ДанныеОрганизации.Организация);
	КонецЦикла;
	
	КомандыСозданияГрафикаОтпусков = Новый ФиксированноеСоответствие(ИменаКоманд);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииПометкиВключитьВСбор(ТекущиеДанные)
	
	Если ТекущиеДанные.ВключитьВСбор = 2 Тогда
		ТекущиеДанные.ВключитьВСбор = 0;
	КонецЕсли;
	УстановитьПометкуПодчиненных(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПодчиненных(Родитель)
	
	ДочерниеЭлементы = Родитель.ПолучитьЭлементы();
	Для Каждого ДочернийЭлемент Из ДочерниеЭлементы Цикл 
		СборЗавершен = ДочернийЭлемент.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияСбораГрафиковОтпусков.Утверждено")
			Или ДочернийЭлемент.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияСбораГрафиковОтпусков.Отказано");
		Если Не СборЗавершен Тогда 
			ДочернийЭлемент.ВключитьВСбор = Родитель.ВключитьВСбор;
		КонецЕсли;
		УстановитьПометкуПодчиненных(ДочернийЭлемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруКампанииСбораГрафиковОтпусков(ТекущийОбъект)
	
	СобранныеГрафикиЗначения = РеквизитФормыВЗначение("СобранныеГрафики");
	
	ВключаемыеВСборЗаписи = ЗаполнитьВключаемыеВСборПодразделения(ТекущийОбъект, СобранныеГрафикиЗначения);
	ИсключаемыеИзСбораЗаписи = ЗаполнитьИсключаемыеИзСбораПодразделения(ТекущийОбъект, СобранныеГрафикиЗначения);
	ЗаполнитьОтветственныхЗаСбор(ВключаемыеВСборЗаписи);
	
	СборЗавершен = ?(ТекущийОбъект.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Черновик
						Или ТекущийОбъект.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.ВРаботе,
						Ложь, Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого ЗаписьСбора Из ВключаемыеВСборЗаписи Цикл
		Если Не ЗначениеЗаполнено(ЗаписьСбора.ГрафикСбора) Тогда
			ГрафикПодразделенияОбъект = Документы.СборГрафиковОтпусков.СоздатьДокумент();
			ЗаполнитьДокументСборГрафиковОтпусковПодразделения(ГрафикПодразделенияОбъект, ЗаписьСбора, ТекущийОбъект.СборПоПодразделениям);
			ГрафикПодразделенияОбъект.Записать();
		ИначеЕсли ЗначениеЗаполнено(ЗаписьСбора.ГрафикСбора) Тогда
			СостояниеГрафикаПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьСбора.ГрафикСбора, "Состояние");
			Если СостояниеГрафикаПодразделения <> ТекущийОбъект.Состояние И Не СборЗавершен Тогда
				ГрафикПодразделенияОбъект = ЗаписьСбора.ГрафикСбора.ПолучитьОбъект();
				ГрафикПодразделенияОбъект.Состояние = ТекущийОбъект.Состояние;
				ГрафикПодразделенияОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ЗаписьСбора Из ИсключаемыеИзСбораЗаписи Цикл
		Если ЗначениеЗаполнено(ЗаписьСбора.ГрафикСбора) Тогда
			СостояниеГрафикаПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьСбора.ГрафикСбора, "Состояние");
			Если СостояниеГрафикаПодразделения <> Перечисления.СостоянияСбораГрафиковОтпусков.Отказано Тогда
				ГрафикПодразделенияОбъект = ЗаписьСбора.ГрафикСбора.ПолучитьОбъект();
				ГрафикПодразделенияОбъект.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Отказано;
				ГрафикПодразделенияОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументСборГрафиковОтпусковПодразделения(ДокументОбъект, СтруктураОбъекта, СборПоПодразделениям)
	
	Если ЗначениеЗаполнено(СтруктураОбъекта.Дата) Тогда 
		ДокументОбъект.Дата = СтруктураОбъекта.Дата;
	Иначе
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	ДокументОбъект.Год 						= СтруктураОбъекта.Год;
	ДокументОбъект.Подразделение			= СтруктураОбъекта.Подразделение;
	ДокументОбъект.Состояние				= СтруктураОбъекта.СостояниеСбораГрафиковОтпусков;
	ДокументОбъект.КорневойСборГрафиков 	= СтруктураОбъекта.КорневойСборГрафиков;
	ДокументОбъект.ИдентификаторДокумента 	= СтруктураОбъекта.ИдентификаторДокумента;
	
	Если ЗначениеЗаполнено(СтруктураОбъекта.ОтветственныйЗаСбор) Тогда
		ДокументОбъект.ОтветственныйЗаСбор 	= СтруктураОбъекта.ОтветственныйЗаСбор;
	КонецЕсли;

	ДокументОбъект.ПожеланияСотрудниковВидныТолькоОтветственному = СтруктураОбъекта.ПожеланияСотрудниковВидныТолькоОтветственному; 

	Если Не СборПоПодразделениям Тогда
		ДокументОбъект.Внешний = Истина;
	Иначе
		ДокументОбъект.Внешний = Ложь;
	КонецЕсли;
	
	Если СтруктураОбъекта.СостояниеСбораГрафиковОтпусков = Перечисления.СостоянияСбораГрафиковОтпусков.Отказано Тогда
		ДокументОбъект.СборАннулирован = Истина;
		ДокументОбъект.ДатаАннулирования = ДокументОбъект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьДеревоПодразделений(ПодразделенияИзПравилВыгрузки, СборыПоПодразделениям)
	
	Подразделения = ОбщегоНазначенияБЗККлиентСервер.КлючиСоответствия(СборыПоПодразделениям);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Подразделения, ПодразделенияИзПравилВыгрузки, Истина);
	РодителиПодразделений = ИнтеграцияУправлениеПерсоналом.РодителиПодразделений(Подразделения);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Подразделения, РодителиПодразделений, Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПодразделенийСборов", Подразделения);
	Если ПубликоватьСтруктуруЮридическихЛиц Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Подразделение,
		|	Подразделения.Наименование КАК Наименование,
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК Подразделения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО Подразделения.Владелец = Организации.Ссылка
		|ГДЕ
		|	Подразделения.Ссылка В(&МассивПодразделенийСборов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организации.Наименование,
		|	Подразделения.РеквизитДопУпорядочиванияИерархического
		|ИТОГИ ПО
		|	Организация,
		|	Подразделение ИЕРАРХИЯ";
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		ДеревоСтруктуры = Новый ДеревоЗначений;              
		ДеревоСтруктуры.Колонки.Добавить("Подразделение");
		ДеревоСтруктуры.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
		
		ТекущаяОрганизация = Неопределено;
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ВыборкаОрганизаций = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

			Пока ВыборкаОрганизаций.Следующий() Цикл
				
				НоваяСтрока = ДеревоСтруктуры.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОрганизаций);
				НоваяСтрока.Наименование = Строка(ВыборкаОрганизаций.Организация);
				
				ВыборкаПодразделений = ВыборкаОрганизаций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
				
				ЗаполнитьСтрокиДереваСтруктуры(НоваяСтрока, ВыборкаПодразделений);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат ДеревоСтруктуры;
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	СтруктураПредприятия.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Ссылка В (&МассивПодразделенийСборов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение ИЕРАРХИЯ";
		
		Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокиДереваСтруктуры(СтрокаДерева, ИерархическаяВыборка)
	
	Пока ИерархическаяВыборка.Следующий() Цикл
		
		Если ИерархическаяВыборка.ТипЗаписи() <> ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			
			Если СтрокаДерева.Подразделение <> ИерархическаяВыборка.Подразделение Тогда
				НоваяСтрока = СтрокаДерева.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ИерархическаяВыборка,"Подразделение, Наименование");
			КонецЕсли;
			
			Если ИерархическаяВыборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда    
				ВыборкаПодразделений = ИерархическаяВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, ИерархическаяВыборка.Группировка());
			Иначе
				ВыборкаПодразделений = ИерархическаяВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			КонецЕсли;
			
			ЗаполнитьСтрокиДереваСтруктуры(НоваяСтрока, ВыборкаПодразделений); 
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиДерева(ИсходноеДерево, ДеревоПодразделений, СборыПоПодразделениям, ПодразделенияИзПравилВыгрузки, ПодразделенияССотрудниками)
	
	СборыПоПодразделениямИнициированы = (СборыПоПодразделениям.Количество() <> 0);
	НомерСтроки = 1;
	Для Каждого СтрокаДерева Из ДеревоПодразделений.Строки Цикл
		
		НоваяСтрока = ИсходноеДерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева, "Подразделение, Наименование");
		НоваяСтрока.НомерСтроки = НомерСтроки;
		
		СборПоПодразделению = СборыПоПодразделениям.Получить(НоваяСтрока.Подразделение);
		Если ЗначениеЗаполнено(СборПоПодразделению) Тогда 
			ЗаполнитьСтрокуДереваПоСбору(НоваяСтрока, СборПоПодразделению);
			Если ЗначениеЗаполнено(СборПоПодразделению.ОтветственныйЗаСбор) Тогда
				НоваяСтрока.РуководительПредставление = Строка(СборПоПодразделению.ОтветственныйЗаСбор);
			КонецЕсли;
		КонецЕсли; 
		
		НоваяСтрока.Выгружать = Ложь;
		Если ПодразделенияИзПравилВыгрузки[НоваяСтрока.Подразделение] = Истина Тогда
			НоваяСтрока.Выгружать = Истина;
		КонецЕсли;
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ЗаполнитьСтрокиДерева(НоваяСтрока, СтрокаДерева, СборыПоПодразделениям, ПодразделенияИзПравилВыгрузки, ПодразделенияССотрудниками);
		КонецЕсли;
		
		НоваяСтрока.ВключитьВСбор = 0;
		Если Объект.СборПоПодразделениям И ПодразделенияССотрудниками[НоваяСтрока.Подразделение] = Истина Тогда
			Если Не СборыПоПодразделениямИнициированы И НоваяСтрока.Выгружать Тогда
				НоваяСтрока.ВключитьВСбор = 1;
			ИначеЕсли СборыПоПодразделениямИнициированы И ЗначениеЗаполнено(НоваяСтрока.ГрафикОтпусков)
				И Не (НоваяСтрока.Состояние = Перечисления.СостоянияСбораГрафиковОтпусков.Отказано) Тогда
				НоваяСтрока.ВключитьВСбор = 1;
			КонецЕсли;
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокиБезСборов(ИсходноеДерево)
	
	МассивУдаляемых = Новый Массив;
	Для Каждого СтрокаДерева Из ИсходноеДерево.Строки Цикл  
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ОбработатьСтрокиБезСборов(СтрокаДерева);	
		КонецЕсли;         
		
		Если СтрокаДерева.Строки.Количество() = 0 И НЕ ЗначениеЗаполнено(СтрокаДерева.ГрафикОтпусков) Тогда
			МассивУдаляемых.Добавить(СтрокаДерева);	
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого СтрокаДерева Из МассивУдаляемых Цикл
		ИсходноеДерево.Строки.Удалить(СтрокаДерева);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСборыПоПодразделениям()
	
	ПодразделениеСборГрафиков = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат ПодразделениеСборГрафиков
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КорневойСборГрафиков", Объект.Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументСборГрафиковОтпусков.Ссылка КАК СборГрафиков,
		|	ДокументСборГрафиковОтпусков.Год КАК Год,
		|	ДокументСборГрафиковОтпусков.Дата КАК Дата,
		|	ДокументСборГрафиковОтпусков.Подразделение КАК Подразделение,
		|	ДокументСборГрафиковОтпусков.ОтветственныйЗаСбор КАК ОтветственныйЗаСбор,
		|	ДокументСборГрафиковОтпусков.Состояние КАК Состояние,
		|	ДокументСборГрафиковОтпусков.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ДокументСборГрафиковОтпусков.КоличествоСотрудников КАК КоличествоСотрудников
		|ИЗ
		|	Документ.СборГрафиковОтпусков КАК ДокументСборГрафиковОтпусков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборГрафиковОтпусков КАК КорневыеСборы
		|		ПО (КорневыеСборы.Ссылка = ДокументСборГрафиковОтпусков.КорневойСборГрафиков)
		|ГДЕ
		|	КорневыеСборы.Ссылка = &КорневойСборГрафиков
		|	И ДокументСборГрафиковОтпусков.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияСбораГрафиковОтпусков.Черновик), ЗНАЧЕНИЕ(Перечисление.СостоянияСбораГрафиковОтпусков.ВРаботе), ЗНАЧЕНИЕ(Перечисление.СостоянияСбораГрафиковОтпусков.Утверждено))";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	Для Каждого Запись Из РезультатЗапроса Цикл
		ПодразделениеСборГрафиков.Вставить(Запись.Подразделение, Запись);
	КонецЦикла; 
	
	Возврат ПодразделениеСборГрафиков;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуДереваПоСбору(СтрокаДерева, СборПоПодразделению)
	СтрокаДерева.ГрафикОтпусков = СборПоПодразделению.СборГрафиков;
	СтрокаДерева.Состояние = СборПоПодразделению.Состояние;
	СтрокаДерева.ЗапланировалоОтпуск = СборПоПодразделению.КоличествоСотрудников;
	СтрокаДерева.Год = СборПоПодразделению.Год;
	СтрокаДерева.Дата = СборПоПодразделению.Дата;
	СтрокаДерева.ОтветственныйЗаСбор = СборПоПодразделению.ОтветственныйЗаСбор;
	СтрокаДерева.ИдентификаторДокумента = СборПоПодразделению.ИдентификаторДокумента;	
	ЗаполнитьЗапланировалоОтпуск(СтрокаДерева, СтрокаДерева.ЗапланировалоОтпуск);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапланировалоОтпуск(СтрокаДерева, ЗапланировалоОтпуск)
	Если Не СтрокаДерева.Родитель = Неопределено Тогда
		СтрокаДерева.Родитель.ЗапланировалоОтпуск = СтрокаДерева.Родитель.ЗапланировалоОтпуск + ЗапланировалоОтпуск;
		ЗаполнитьЗапланировалоОтпуск(СтрокаДерева.Родитель, ЗапланировалоОтпуск);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСобранныеГрафики()
	
	СборыПоПодразделениям = ПолучитьСборыПоПодразделениям();
	ПодразделенияИзПравилВыгрузки = ИнтеграцияКабинетСотрудникаРасширенный.ПодразделенияПравилДляСбораГрафикаОтпусков();
	
	УстановитьПривилегированныйРежим(Истина);
	СотрудникиПодразделений = СотрудникиПодразделений(ПодразделенияИзПравилВыгрузки);
	УстановитьПривилегированныйРежим(Ложь);
	ПодразделенияССотрудниками = Новый Соответствие;
	Для каждого КлючИЗначение Из СотрудникиПодразделений Цикл
		ПодразделенияССотрудниками.Вставить(КлючИЗначение.Ключ, ЗначениеЗаполнено(КлючИЗначение.Значение));
	КонецЦикла;
	
	ДеревоПодразделений = СформироватьДеревоПодразделений(ПодразделенияИзПравилВыгрузки, СборыПоПодразделениям);
	
	ИсходноеДерево = РеквизитФормыВЗначение("СобранныеГрафики");
	ИсходноеДерево.Строки.Очистить();
	
	ЗаполнитьСтрокиДерева(
		ИсходноеДерево, 
		ДеревоПодразделений, 
		СборыПоПодразделениям,
		ОбщегоНазначенияБЗККлиентСервер.МассивВСоответствие(ПодразделенияИзПравилВыгрузки),
		ПодразделенияССотрудниками);
	
	Если Объект.Внешний Тогда
		ОбработатьСтрокиБезСборов(ИсходноеДерево);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ИсходноеДерево, "СобранныеГрафики");
	 
КонецПроцедуры

&НаСервере
Функция СотрудникиПодразделений(Подразделения)
	
	СотрудникиПодразделений = Новый Соответствие;
	Если Не ЗначениеЗаполнено(Подразделения) Тогда
		Возврат СотрудникиПодразделений;
	КонецЕсли;
	
	КадровыеДанныеСтрока = "Подразделение,ГоловнаяОрганизация,Должность";
	ТребуетсяСтруктураПредприятия = ТипЗнч(Подразделения[0]) <> Тип("СправочникСсылка.ПодразделенияОрганизаций");
	ВедетсяШтатноеРасписание = ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание");
	Если ТребуетсяСтруктураПредприятия И ВедетсяШтатноеРасписание Тогда
		КадровыеДанныеСтрока = СтрШаблон("%1,%2", КадровыеДанныеСтрока, "МестоВСтруктуреПредприятия");
	КонецЕсли;
	
	ДатаАктуальности = ТекущаяДатаСеанса();
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.КадровыеДанные 	= КадровыеДанныеСтрока;
	ПараметрыПолучения.НачалоПериода 	= ДатаАктуальности;
	ПараметрыПолучения.ОкончаниеПериода = ДатаАктуальности;
	ПараметрыПолучения.РаботникиПоТрудовымДоговорам = Истина;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Истина, ПараметрыПолучения);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УправленческаяОрганизация", УправленческаяОрганизация());
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ПодразделенияСотрудников = Новый Соответствие;
	Если ТребуетсяСтруктураПредприятия И Не ВедетсяШтатноеРасписание Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровыеДанные.Сотрудник КАК Сотрудник,
		|	ШтатноеРасписание.Ссылка КАК ДолжностьПоШтатномуРасписанию,
		|	КадровыеДанные.Подразделение КАК Подразделение
		|ИЗ
		|	ВТСотрудникиОрганизации КАК КадровыеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО КадровыеДанные.Подразделение = ШтатноеРасписание.Подразделение
		|			И КадровыеДанные.Должность = ШтатноеРасписание.Должность
		|ГДЕ
		|	КадровыеДанные.ГоловнаяОрганизация <> &УправленческаяОрганизация";
		ТаблицаПозиций = Запрос.Выполнить().Выгрузить();
		
		ПозицииСотрудников = Новый Соответствие;
		Для каждого СтрокаТЗ Из ТаблицаПозиций Цикл
			ПозицииСотрудников.Вставить(СтрокаТЗ.ДолжностьПоШтатномуРасписанию, СтрокаТЗ.Сотрудник);
		КонецЦикла;
		
		Позиции = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаПозиций,"ДолжностьПоШтатномуРасписанию",Истина);
		
		СтруктураПредприятия = Новый Массив;
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
			МодульОрганизационнаяСтруктура = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
			СтруктураПредприятия = МодульОрганизационнаяСтруктура.МестаПозицийВСтруктуреПредприятия(Позиции);
		КонецЕсли;
		
		Для каждого СтрокаКоллекции Из СтруктураПредприятия Цикл
			Сотрудник = ПозицииСотрудников[СтрокаКоллекции.Позиция];
			Если ЗначениеЗаполнено(Сотрудник) Тогда
				Сотрудники = СотрудникиПодразделений[СтрокаКоллекции.Подразделение];
				Если Сотрудники = Неопределено Тогда
					Сотрудники = Новый Массив;
				КонецЕсли;
				Сотрудники.Добавить(Сотрудник);
				СотрудникиПодразделений.Вставить(СтрокаКоллекции.Подразделение, Сотрудники);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ИмяКолонкиПодразделение = "ПодразделениеОрганизации";
		Если ТребуетсяСтруктураПредприятия Тогда
			ИмяКолонкиПодразделение = "МестоВСтруктуреПредприятия";
		КонецЕсли;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	*
		|ИЗ
		|	ВТСотрудникиОрганизации КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ГоловнаяОрганизация <> &УправленческаяОрганизация";
		КадровыеДанные = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаТЗ Из КадровыеДанные Цикл
			Подразделение = СтрокаТЗ[ИмяКолонкиПодразделение];
			Сотрудники = СотрудникиПодразделений[Подразделение];
			Если Сотрудники = Неопределено Тогда
				Сотрудники = Новый Массив;
			КонецЕсли;
			Сотрудники.Добавить(Сотрудник);
			СотрудникиПодразделений.Вставить(Подразделение, Сотрудники);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СотрудникиПодразделений;
	
КонецФункции

&НаСервере
Функция УправленческаяОрганизация()
	
	УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	Если УправленческаяОрганизация = Неопределено Тогда 
		УправленческаяОрганизация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат УправленческаяОрганизация;

КонецФункции

#КонецОбласти
